# Pandas—Task02：pandas基础

In [145]:
import numpy as np
import pandas as pd

In [146]:
pd.__version__

'1.1.5'

# 一、文件的读取和写入
pandas 可以读取的文件格式有很多，这里主要介绍读取 csv, excel, txt 文件

## 1.文件读取

In [147]:
%cd drive/MyDrive/
!ls

[Errno 2] No such file or directory: 'drive/MyDrive/'
/content/drive/MyDrive
'Colab Notebooks'   data

In [ ]:
df_csv = pd.read_csv('data/my_csv.csv')
df_csv

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2
2     6    c   2.5  orange  2020/1/5
3     5    d   3.2   lemon  2020/1/7

In [ ]:
# 尝试写出txt、excel的读取
df_txt = pd.read_table('data/my_table.txt')
df_excel = pd.read_excel('data/my_excel.xlsx')

In [ ]:
df_txt

   col1 col2  col3             col4
0     2    a   1.4   apple 2020/1/1
1     3    b   3.4  banana 2020/1/2
2     6    c   2.5  orange 2020/1/5
3     5    d   3.2   lemon 2020/1/7

常用的公共参数：

1、header=None 表示第一行，不作为列名；     
2、index_col 表示把某一列或几列作为索引；    
3、usecols 表示读取列的集合，默认读取所有列      
4、parse_dates 表示需要转化为时间的列    
5、nrows 表示读取的数据行数

In [ ]:
pd.read_table('data/my_table.txt', header=None)
pd.read_csv('data/my_csv.csv', index_col=['col1', 'col2']) #usecols、index_col用法类似
pd.read_excel('data/my_excel.xlsx', nrows=2)

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2

读取 txt 文件时，经常遇到分隔符非空格的情况， read_table 有一个分割参数 sep ，它使得用户可以自定义分割符号，进行 txt 数据的读取

例如，当读取的表以||||为分割时，可以用sep，同时需要制定引擎为python

In [ ]:
pd.read_table('data/my_table_special_sep.txt')#效果不好，读出的结果有||||分割
pd.read_table('data/my_table_special_sep.txt',sep=' \|\|\|\| ', engine='python')
# 用sep分割参数自定义分割符，再进行读取
#注意：sep是正则参数！！！所以在使用参数 sep 时，需要对 | 进行转义，否则无法读取到正确的结果

  col1               col2
0   TS  This is an apple.
1   GQ    My name is Bob.
2   WT         Well done!
3   PT    May I help you?

## 2.数据写入

一般在数据写入中，最常用的操作是把 index 设置为 False ，特别当索引没有特殊意义的时候，这样的行为能把索引在保存的时候去除

In [ ]:
df_csv.to_csv('data/my_csv_saved.csv', index=False)
df_excel.to_excel('data/my_excel_saved.xlsx', index=False)

！！注意：pandas中没有定义to_table函数，但to_csv可以保存为txt文件，且允许允许自定义分隔符，常用制表符 \t 分割

In [ ]:
df_txt.to_csv('data/my_txt_saved.txt',sep='\t', index=False)

如果想要把表格快速转换为 markdown 和 latex 语言，可以使用 to_markdown 和 to_latex 函数，此处需要安装 tabulate 包

In [ ]:
print(df_csv.to_markdown())
print(df_csv.to_latex())

|    |   col1 | col2   |   col3 | col4   | col5     |
|---:|-------:|:-------|-------:|:-------|:---------|
|  0 |      2 | a      |    1.4 | apple  | 2020/1/1 |
|  1 |      3 | b      |    3.4 | banana | 2020/1/2 |
|  2 |      6 | c      |    2.5 | orange | 2020/1/5 |
|  3 |      5 | d      |    3.2 | lemon  | 2020/1/7 |
\begin{tabular}{lrlrll}
\toprule
{} &  col1 & col2 &  col3 &    col4 &      col5 \\
\midrule
0 &     2 &    a &   1.4 &   apple &  2020/1/1 \\
1 &     3 &    b &   3.4 &  banana &  2020/1/2 \\
2 &     6 &    c &   2.5 &  orange &  2020/1/5 \\
3 &     5 &    d &   3.2 &   lemon &  2020/1/7 \\
\bottomrule
\end{tabular}

# 二、基本数据结构
pandas 中具有两种基本的数据存储结构，存储一维 values 的 Series 和存储二维 values 的 DataFrame

## 1.Series
Series 一般由四个部分组成，分别是序列的值 data 、索引 index 、存储类型 dtype 、序列的名字 name 。其中，索引也可以指定它的名字，默认为空

In [ ]:
s = pd.Series(data = [100, 'a', {'dic1':5}],
   index = pd.Index(['id1', 20, 'third'], name='my_idx'),
   dtype = 'object',
   name = 'my_name')
s

my_idx
id1              100
20                 a
third    {'dic1': 5}
Name: my_name, dtype: object

!! 注意：object 代表了一种混合类型，正如上面的例子中存储了整数、字符串以及 Python 的字典数据结构。此外，目前 pandas 把纯字符串序列也默认认为是一种 object 类型的序列，但它也可以用 string 类型存储

（1）可以通过 . 的方式获取属性

In [ ]:
s.values

array([100, 'a', {'dic1': 5}], dtype=object)

In [ ]:
s.index

Index(['id1', 20, 'third'], dtype='object', name='my_idx')

In [ ]:
s.dtype

dtype('O')

In [ ]:
s.name

'my_name'

（2）可以用 .shape 获取序列长度

In [ ]:
s.shape

(3,)

（3）取出单个索引对应的值，可以用[index_item]

## 2.DataFrame

DataFrame 在 Series 的基础上增加了列索引，一个数据框可以由二维的 data 与行列索引来构造

In [ ]:
data = [[1, 'a', 1.2], [2, 'b', 2.2], [3, 'c', 3.2]]
df = pd.DataFrame(data = data,
    index = ['row_%d'%i for i in range(3)],
    columns=['col_0', 'col_1', 'col_2'])
df

       col_0 col_1  col_2
row_0      1     a    1.2
row_1      2     b    2.2
row_2      3     c    3.2

一般而言，更多的时候会采用从列索引名到数据的映射来构造数据框，同时再加上行索引

In [ ]:
df = pd.DataFrame(data = {'col_0': [1,2,3], 'col_1':list('abc'),
    'col_2': [1.2, 2.2, 3.2]},
   index = ['row_%d'%i for i in range(3)])
df

       col_0 col_1  col_2
row_0      1     a    1.2
row_1      2     b    2.2
row_2      3     c    3.2

在 DataFrame 中可以用 [col_name] 与 [col_list] 来取出相应的列与由多个列组成的表，结果分别为 Series 和 DataFrame

In [ ]:
 df['col_0']#单列
 df[['col_0', 'col_1']]#多列

       col_0 col_1
row_0      1     a
row_1      2     b
row_2      3     c

与 Series 类似，在数据框中同样可以取出相应的属性

In [ ]:
df.values

array([[1, 'a', 1.2],
       [2, 'b', 2.2],
       [3, 'c', 3.2]], dtype=object)

In [ ]:
df.dtypes # 返回的是值为相应列数据类型的Series

col_0      int64
col_1     object
col_2    float64
dtype: object

DataFrame转置： .T

In [ ]:
df.T

      row_0 row_1 row_2
col_0     1     2     3
col_1     a     b     c
col_2   1.2   2.2   3.2

# 三、常用基本函数
learn_pandas.csv 的虚拟数据集，记录了四所学校学生的体测个人信息。作为后续举例说明

In [ ]:
df = pd.read_csv('data/learn_pandas.csv')
df.columns
# out：Index(['School', 'Grade', 'Name', 'Gender', 'Height', 'Weight', 'Transfer',
# 'Test_Number', 'Test_Date', 'Time_Record'],dtype='object')

Index(['School', 'Grade', 'Name', 'Gender', 'Height', 'Weight', 'Transfer',
       'Test_Number', 'Test_Date', 'Time_Record'],
      dtype='object')

上述列名依次代表学校、年级、姓名、性别、身高、体重、是否为转系生、体测场次、测试时间、1000米成绩

In [ ]:
df = df[df.columns[:7]]
df

                            School      Grade  ... Weight Transfer
0    Shanghai Jiao Tong University   Freshman  ...   46.0        N
1                Peking University   Freshman  ...   70.0        N
2    Shanghai Jiao Tong University     Senior  ...   89.0        N
3                 Fudan University  Sophomore  ...   41.0        N
4                 Fudan University  Sophomore  ...   74.0        N
..                             ...        ...  ...    ...      ...
195               Fudan University     Junior  ...   46.0        N
196            Tsinghua University     Senior  ...   50.0        N
197  Shanghai Jiao Tong University     Senior  ...   45.0        N
198  Shanghai Jiao Tong University     Senior  ...   71.0        N
199            Tsinghua University  Sophomore  ...   51.0        N

[200 rows x 7 columns]

## 1.汇总函数
head, tail 函数分别表示返回表或者序列的前 n 行和后 n 行，其中 n 默认为5

In [ ]:
df.head(2) #前2行
df.tail(3) #后3行

                            School      Grade  ... Weight Transfer
197  Shanghai Jiao Tong University     Senior  ...   45.0        N
198  Shanghai Jiao Tong University     Senior  ...   71.0        N
199            Tsinghua University  Sophomore  ...   51.0        N

[3 rows x 7 columns]

info, describe 分别返回表的 信息概况 和表中 数值列对应的主要统计量

In [ ]:
df.info()
#输出结果如下：
# <class 'pandas.core.frame.DataFrame'>
# RangeIndex: 200 entries, 0 to 199
# Data columns (total 7 columns):
#  #   Column    Non-Null Count  Dtype  
# ---  ------    --------------  -----  
#  0   School    200 non-null    object 
#  1   Grade     200 non-null    object 
#  2   Name      200 non-null    object 
#  3   Gender    200 non-null    object 
#  4   Height    183 non-null    float64
#  5   Weight    189 non-null    float64
#  6   Transfer  188 non-null    object 
# dtypes: float64(2), object(5)
# memory usage: 11.1+ KB

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   School    200 non-null    object
 1   Grade     200 non-null    object
 2   Name      200 non-null    object
 3   Gender    200 non-null    object
 4   Height    183 non-null    float64
 5   Weight    189 non-null    float64
 6   Transfer  188 non-null    object
dtypes: float64(2), object(5)
memory usage: 11.1+ KB

In [ ]:
df.describe()
#输出结果如下：
#    Height      Weight
# count  183.000000  189.000000
# mean   163.218033   55.015873
# std      8.608879   12.824294
# min    145.400000   34.000000
# 25%    157.150000   46.000000
# 50%    161.900000   51.000000
# 75%    167.500000   65.000000
# max    193.900000   89.000000

           Height      Weight
count  183.000000  189.000000
mean   163.218033   55.015873
std      8.608879   12.824294
min    145.400000   34.000000
25%    157.150000   46.000000
50%    161.900000   51.000000
75%    167.500000   65.000000
max    193.900000   89.000000

！！注意：info, describe 只能实现较少信息的展示，如果想要对一份数据集进行全面且有效的观察，特别是在列较多的情况下，推荐使用 pandas-profiling 包

## 2.特征统计函数
在 Series 和 DataFrame 上定义了许多统计函数，最常见的是 sum, mean, median, var, std, max, min

In [ ]:
df_demo = df[['Height', 'Weight']]
df_demo.mean() #输出身高、体重的平均值
df_demo.max() #输出身高、体重的最大值

Height    193.9
Weight     89.0
dtype: float64

quantile：分位数；count：非缺失值个数；idxmax：最大值对应的索引

In [ ]:
df_demo.quantile(0.75)
df_demo.count()
df_demo.idxmax() # idxmin是对应的函数

Height    193
Weight      2
dtype: int64

！！注意：以上所有的函数，由于操作后返回的是标量，所以又称为聚合函数，它们有一个公共参数 axis ，默认为0代表逐列聚合，如果设置为1则表示逐行聚合

In [ ]:
df_demo.mean(axis=1).head() # 在这个数据集上体重和身高的均值并没有意义

0    102.45
1    118.25
2    138.95
3     41.00
4    124.00
dtype: float64

## 3.唯一值函数
对序列使用 unique 和 nunique 可以分别得到其唯一值组成的列表和唯一值的个数

In [ ]:
df['School'].unique()#去重，返回值
df['School'].nunique()#去重，返回个数

4

value_counts 可以得到唯一值和其对应出现的频数

In [ ]:
df['School'].value_counts()
#输出结果如下：
# Tsinghua University          69
# Shanghai Jiao Tong University    57
# Fudan University            40
# Peking University           34
# Name: School, dtype: int64

Tsinghua University              69
Shanghai Jiao Tong University    57
Fudan University                 40
Peking University                34
Name: School, dtype: int64

drop_duplicates 观察多个列组合的唯一值。
关键参数是 keep ，默认值 first 表示每个组合保留第一次出现的所在行， last 表示保留最后一次出现的所在行， False 表示把所有重复组合所在的行剔除

In [ ]:
df_demo = df[['Gender','Transfer','Name']]
df_demo.drop_duplicates(['Gender', 'Transfer'])
df_demo.drop_duplicates(['Gender', 'Transfer'], keep='last') # 表示保留最后一次出现的所在行
df_demo.drop_duplicates(['Name', 'Gender'],keep=False).head() # 保留只出现过一次的性别和姓名组合
df['School'].drop_duplicates() # 在Series上也可以使用

0    Shanghai Jiao Tong University
1                Peking University
3                 Fudan University
5              Tsinghua University
Name: School, dtype: object

duplicated 和 drop_duplicates 的功能类似，但前者返回了是否为唯一值的布尔列表，其 keep 参数与后者一致。其返回的序列，把重复元素设为 True ，否则为 False 。 drop_duplicates 等价于把 duplicated 为 True 的对应行剔除。

In [ ]:
df_demo.duplicated(['Gender', 'Transfer']).head()
df['School'].duplicated().head() # 在Series上也可以使用

0    False
1    False
2     True
3    False
4     True
Name: School, dtype: bool

## 4.替换函数
一般，替换操作是针对某一个列进行的，因此下面的例子都以 Series 举例

pandas 中的替换函数可以归纳为三类：映射替换、逻辑替换、数值替换。

（1）映射替换： replace 中，可以通过字典构造，或者传入两个列表来进行替换

In [ ]:
df['Gender'].replace({'Female':0, 'Male':1}).head() # 字典构造
df['Gender'].replace(['Female', 'Male'], [0, 1]).head() # 列表构造

0    0
1    1
2    1
3    0
4    1
Name: Gender, dtype: int64

replace 还有一种特殊的方向替换，指定 method 参数为 ffill 则为用前面一个最近的未被替换的值进行替换， bfill 则使用后面最近的未被替换的值进行替换

In [ ]:
s = pd.Series(['a', 1, 'b', 2, 1, 1, 'a'])
s.replace([1, 2], method='ffill') # 替换后输出 a,a,b,a,b,b,b,a
s.replace([1, 2], method='bfill') # 替换后输出 a,b,b,a,a,a,a

0    a
1    b
2    b
3    a
4    a
5    a
6    a
dtype: object

！！注意：正则替换请使用 str.replace！！
虽然对于 replace 而言可以使用正则替换，但是当前版本下对于 string 类型的正则替换还存在 bug ，因此如有此需求，请选择 str.replace 进行替换操作

（2）逻辑替换： where 和 mask

这两个函数是完全对称的。
where：在传入条件为 False 的对应行进行替换；
mask：在传入条件为 True 的对应行进行替换，当不指定替换值时，替换为缺失值

In [ ]:
 s = pd.Series([-1, 1.2345, 100, -50])
 s.where(s<0) # T,F,F,T
 s.mask(s<0) # T,F,F,T

0         NaN
1      1.2345
2    100.0000
3         NaN
dtype: float64

In [ ]:
s.where(s<0, 100) # 传入条件为 F 的时候替换，即把s>0的值换为100
s.mask(s<0, -50) # 传入条件为 T 的时候替换，即把s<0的值换为-50

0    -50.0000
1      1.2345
2    100.0000
3    -50.0000
dtype: float64

（3）数值替换

round：按照给定精度四舍五入；abs：取绝对值；clip：截断

In [ ]:
s = pd.Series([-1, 1.2345, 100, -50])
s.round(2)#保留两位
s.abs()
s.clip(0, 2) # 前两个数分别表示上下截断边界，输出 0,1.2345,2,0

0    0.0000
1    1.2345
2    2.0000
3    0.0000
dtype: float64

## 5.排序函数

排序共有两种方式，其一为值排序，其二为索引排序，对应的函数是 sort_values 和 sort_index

In [ ]:
df_demo = df[['Grade', 'Name', 'Height','Weight']].set_index(['Grade','Name'])
df
#用 set_index 方法把年级和姓名两列作为索引

                            School      Grade  ... Weight Transfer
0    Shanghai Jiao Tong University   Freshman  ...   46.0        N
1                Peking University   Freshman  ...   70.0        N
2    Shanghai Jiao Tong University     Senior  ...   89.0        N
3                 Fudan University  Sophomore  ...   41.0        N
4                 Fudan University  Sophomore  ...   74.0        N
..                             ...        ...  ...    ...      ...
195               Fudan University     Junior  ...   46.0        N
196            Tsinghua University     Senior  ...   50.0        N
197  Shanghai Jiao Tong University     Senior  ...   45.0        N
198  Shanghai Jiao Tong University     Senior  ...   71.0        N
199            Tsinghua University  Sophomore  ...   51.0        N

[200 rows x 7 columns]

默认参数 ascending=True 为升序

In [ ]:
df_demo.sort_values('Height').head()
df_demo.sort_values('Height', ascending=False).head()# 对身高进行排序，降序

                        Height  Weight
Grade    Name
Senior   Xiaoqiang Qin   193.9    79.0
         Mei Sun         188.9    89.0
         Gaoli Zhao      186.5    83.0
Freshman Qiang Han       185.3    87.0
Senior   Qiang Zheng     183.9    87.0

多列排序的问题，比如在体重相同的情况下，对身高进行排序，并且保持身高降序排列，体重升序排列

In [ ]:
df_demo.sort_values(['Weight','Height'],ascending=[True,False]).head()
#体重升序，身高降序

                       Height  Weight
Grade     Name
Sophomore Peng Han      147.8    34.0
Senior    Gaomei Lv     147.3    34.0
Junior    Xiaoli Chu    145.4    34.0
Sophomore Qiang Zhou    150.5    36.0
Freshman  Yanqiang Xu   152.4    38.0

索引排序的用法和值排序完全一致，只不过元素的值在索引中，此时需要指定索引层的名字或者层号，用参数 level 表示。另外，需要注意的是字符串的排列顺序由字母顺序决定。

In [ ]:
df_demo.sort_index(level=['Grade','Name'],ascending=[True,False]).head()

                        Height  Weight
Grade    Name
Freshman Yanquan Wang    163.5    55.0
         Yanqiang Xu     152.4    38.0
         Yanqiang Feng   162.3    51.0
         Yanpeng Lv        NaN    65.0
         Yanli Zhang     165.1    52.0

## 6.apply方法

apply 方法常用于 DataFrame 的行迭代或者列迭代，它的 axis 含义与第2小节中的统计聚合函数一致， apply 的参数往往是一个以序列为输入的函数

In [ ]:
df_demo = df[['Height', 'Weight']]
def my_mean(x):
   res = x.mean()
   return res

In [ ]:
# 对于上述 .mean() ，使用 apply 可以如下地写出
df_demo.apply(my_mean)

Height    163.218033
Weight     55.015873
dtype: float64

In [ ]:
#利用 lambda 表达式使得书写简洁，这里的x就指代被调用的df_demo表中逐个输入的序列
df_demo.apply(lambda x:x.mean())

Height    163.218033
Weight     55.015873
dtype: float64

In [ ]:
#若指定 axis=1 ，那么每次传入函数的就是行元素组成的 Series
#其结果与之前的逐行均值结果一致
df_demo.apply(lambda x:x.mean(), axis=1).head()

0    102.45
1    118.25
2    138.95
3     41.00
4    124.00
dtype: float64

例子：ad 函数返回的是一个序列中偏离该序列均值的绝对值大小的均值，例如序列1,3,7,10中，均值为5.25，每一个元素偏离的绝对值为4.25,2.25,1.75,4.75，这个偏离序列的均值为3.25

In [ ]:
#现在利用 apply 计算升高和体重的 mad 指标
df_demo.apply(lambda x:(x-x.mean()).abs().mean())
#使用内置的 mad 函数计算
df_demo.mad()
#两个计算结果一致

Height     6.707229
Weight    10.391870
dtype: float64

！！注意：谨慎使用 apply

得益于传入自定义函数的处理， apply 的自由度很高，但这是以性能为代价的。一般而言，使用 pandas 的内置函数处理和 apply 来处理同一个任务，其速度会相差较多，因此只有在确实存在自定义需求的情境下才考虑使用 apply 。

# 四、窗口对象
pandas 中有3类窗口，分别是滑动窗口 rolling 、扩张窗口 expanding 以及指数加权窗口 ewm

## 1.滑窗对象

要使用滑窗函数，就必须先要对一个序列使用 .rolling 得到滑窗对象，其最重要的参数为窗口大小 window

In [ ]:
s = pd.Series([1,2,3,4,5])
roller = s.rolling(window = 3)
roller

Rolling [window=3,center=False,axis=0]

得到了滑窗对象后，能够使用相应的聚合函数进行计算，需要注意的是窗口包含当前行所在的元素。例如在第四个位置进行均值运算时，应当计算(2+3+4)/3，而不是(1+2+3)/3

In [ ]:
 roller.mean()

0    NaN
1    NaN
2    2.0
3    3.0
4    4.0
dtype: float64

In [ ]:
roller.sum()

0     NaN
1     NaN
2     6.0
3     9.0
4    12.0
dtype: float64

滑动相关系数或滑动协方差的计算

In [ ]:
s2 = pd.Series([1,2,6,16,30])
roller.cov(s2) # 滑动相关系数
roller.corr(s2) # 滑动协方差

0         NaN
1         NaN
2    0.944911
3    0.970725
4    0.995402
dtype: float64

支持使用 apply 传入自定义函数，其传入值是对应窗口的 Series ，例如上述的均值函数可以等效表示

In [ ]:
roller.apply(lambda x:x.mean())

0    NaN
1    NaN
2    2.0
3    3.0
4    4.0
dtype: float64

shift, diff, pct_change 是一组类滑窗函数，它们的公共参数为 periods=n ，默认为1。shift表示取向前第 n 个元素的值；diff表示与向前第 n 个元素做差（与 Numpy 中不同，后者表示 n 阶差分）；pct_change表示与向前第 n 个元素相比计算增长率。这里的 n 可以为负，表示反方向的类似操作

In [ ]:
s = pd.Series([1,3,6,10,15])
s.shift(2) # 取向前第2个元素的值，输出：N,N,1.0,3.0,6.0
s.diff(3) #与向前第 3 个元素做差
s.pct_change() #与向前第 n 个元素相比计算增长率
s.shift(-1) #取向后第1个元素的值

0     3.0
1     6.0
2    10.0
3    15.0
4     NaN
dtype: float64

将其视作类滑窗函数的原因是，它们的功能可以用窗口大小为 n+1 的 rolling 方法等价代替

In [ ]:
s.rolling(3).apply(lambda x:list(x)[0]) # s.shift(2)
s.rolling(4).apply(lambda x:list(x)[-1]-list(x)[0]) # s.diff(3)
def my_pct(x):
 L = list(x)
 return L[-1]/L[0]-1
s.rolling(2).apply(my_pct) # s.pct_change()

0         NaN
1    2.000000
2    1.000000
3    0.666667
4    0.500000
dtype: float64

## 2.扩张窗口
扩张窗口又称累计窗口，可以理解为一个动态长度的窗口，其窗口的大小就是从序列开始处到具体操作的对应位置，其使用的聚合函数会作用于这些逐步扩张的窗口上。

具体地说，设序列为a1, a2, a3, a4，则其每个位置对应的窗口即[a1]、[a1, a2]、[a1, a2, a3]、[a1, a2, a3, a4]

In [ ]:
 s = pd.Series([1, 3, 6, 10])
 s.expanding().mean()

0    1.000000
1    2.000000
2    3.333333
3    5.000000
dtype: float64

# 五、练习

## EX1：口袋妖怪数据集

现有一份口袋妖怪的数据集，下面进行一些背景说明：

‘#’代表全国图鉴编号，不同行存在相同数字则表示为该妖怪的不同状态

妖怪具有单属性和双属性两种，对于单属性的妖怪， Type 2 为缺失值

Total, HP, Attack, Defense, Sp. Atk, Sp. Def, Speed 分别代表种族值、体力、物攻、防御、特攻、特防、速度，其中种族值为后6项之和

In [157]:
#Q1:对后六项进行加总，验证是否为 Total 值
df = pd.read_csv('data/pokemon.csv')
df_demo = df[['HP','Attack','Defense','Sp. Atk','Sp. Def','Speed']]
(df_demo.sum(1)==df['Total']).mean() # 验证每行是否都相等

1.0

In [166]:
#Q2:
df = pd.read_csv('data/pokemon.csv')
df_dup = df.drop_duplicates('#',keep='first') # 对于 '#' 重复的妖怪只保留第一条记录
df_dup['Type 1'].nunique() #第一种属性的种类数

18

In [170]:
df_dup['Type 1'].value_counts().index[0:3] #第一种属性前三多数量对应的种类

Index(['Water', 'Normal', 'Grass'], dtype='object')

In [191]:
df_dupp = df_dup.drop_duplicates(['Type 1','Type 2']) # 对第一、第二属性有重复的进行去重
df_dupp.shape[0] #利用 .shape 可以获取序列的长度,即可求出第一属性和第二属性的组合种类

143

In [ ]:
#求尚未出现过的属性组合

In [195]:
 #Q3:(1)取出物攻，超过120的替换为 high ，不足50的替换为 low ，否则设为 mid
 df['Attack'].mask(df['Attack']>120, 'high').mask(df['Attack']<50, 'low').mask((50<=df['Attack'])&(df['Attack']<=120), 'mid')

0       low
1       mid
2       mid
3       mid
4       mid
       ...
795     mid
796    high
797     mid
798    high
799     mid
Name: Attack, Length: 800, dtype: object

In [202]:
#Q3:(2)取出第一属性，分别用 replace 和 apply 替换所有字母为大写
df['Type 1'].str.upper()

0        GRASS
1        GRASS
2        GRASS
3        GRASS
4         FIRE
        ...
795       ROCK
796       ROCK
797    PSYCHIC
798    PSYCHIC
799       FIRE
Name: Type 1, Length: 800, dtype: object

In [ ]:
df['Type 1'].replace({i:str.upper(i) for i in df['Type 1'].unique()}).head()

In [ ]:
df['Type 1'].apply(lambda x:str.upper(x)).head()

In [219]:
#Q3:(3)求每个妖怪六项能力的离差，即所有能力中偏离中位数最大的值，添加到 df 并从大到小排序
df_demo = df[['HP','Attack','Defense','Sp. Atk','Sp. Def','Speed']]
df_demo['dev'] = df_demo.apply(lambda x:np.max((x-x.median()).abs()), axis=1)#创建一个新的列
df_demo.sort_values('dev',ascending=[False])#降序排序

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

      HP  Attack  Defense  Sp. Atk  Sp. Def  Speed    dev
230   20      10      230       10      230      5  215.0
121  250       5        5       35      105     50  207.5
261  255      10       10       75      135     55  190.0
333   70     140      230       60       80     50  155.0
224   75     125      230       55       95     30  145.0
..   ...     ...      ...      ...      ...    ...    ...
143   48      48       48       48       48     48    0.0
165  100     100      100      100      100    100    0.0
255   35      35       35       35       35     35    0.0
206   30      30       30       30       30     30    0.0
271  100     100      100      100      100    100    0.0

[800 rows x 7 columns]